index=main EventCode=4625 Account_Name!="-"
| where Source_Network_Address!="-" 
    AND Source_Network_Address!="127.0.0.1"
    AND Source_Network_Address!="::1"
| bin _time span=10m
| stats count as fail_count values(host) as hosts by Account_Name Source_Network_Address _time
| where fail_count>=20
| eval risk=case(
    fail_count>=50,"CRITICAL",
    fail_count>=30,"HIGH",
    1=1,"MEDIUM"
)
